#Проверяем последовательность, где * - пропуск
for a1 in '0123456789':
    for a2 in '0123456789':
        s=int('562'+a1+'9'+a2)
        if s<10**9 and s%83==0 and s%353==0:
            print(s, s//83)
#Проверяем последовательность, где * - одна цифра
for a1 in '0123456789':
    for a2 in '0123456789':
        for a3 in '123456789':
            s=int(a3+'562'+a1+'9'+a2)
            if s<10**9 and s%83==0 and s%353==0:
                print(s, s//83)
#Проверяем последовательность, где * - две цифры                
for a1 in '0123456789':
    for a2 in '0123456789':
        for a3 in '0123456789':
            for a4 in '123456789':
                s=int(a4+a3+'562'+a1+'9'+a2)
                if s<10**9 and s%83==0 and s%353==0:
                    print(s, s//83)
#Проверяем последовательность, где * - три цифры
for a1 in '0123456789':
    for a2 in '0123456789':
        for a3 in '0123456789':
            for a4 in '0123456789':
                for a5 in '123456789':
                    s=int(a5+a4+a3+'562'+a1+'9'+a2)
                    if s<10**9 and s%83==0 and s%353==0:
                        print(s, s//83)