#Проверяем последовательность, где *1 - пропуск и *2 - пропуск
for a1 in '123456789':
    for a2 in '0123456789':
        for a3 in '0123456789':
            s=int(a1+'36'+a2+'2'+a3+'48')
            if s<=10**10 and s%35824==0:
                print(s, s//35824)
#Проверяем последовательность, где *1 - одна цифра и *2 - пропуск
for a1 in '0123456789':
    for a2 in '0123456789':
        for a3 in '0123456789':
            for a4 in '123456789':
                s=int(a4+a1+'36'+a2+'2'+a3+'48')
                if s<=10**10 and s%35824==0:
                    print(s, s//35824)
#Проверяем последовательность, где *1 - пропуск и *2 - одна цифра                   
for a1 in '123456789':
    for a2 in '0123456789':
        for a3 in '0123456789':
            for a4 in '0123456789':
                s=int(a1+'36'+a2+'2'+a3+'48'+a4)
                if s<=10**10 and s%35824==0:
                    print(s, s//35824)
#Проверяем последовательность, где *1 - одна цифра и *2 - одна цифра
for a1 in '0123456789':
    for a2 in '0123456789':
        for a3 in '0123456789':
            for a4 in '123456789':
                for a5 in '0123456789':
                    s=int(a4+a1+'36'+a2+'2'+a3+'48'+a5)
                    if s<=10**10 and s%35824==0:
                        print(s, s//35824)
#Проверяем последовательность, где *1 - две цифры и *2-  пропуск
for a1 in '0123456789':
    for a2 in '0123456789':
        for a3 in '0123456789':
            for a4 in '123456789':
                for a5 in '0123456789':
                    s=int(a4+a5+a1+'36'+a2+'2'+a3+'48')
                    if s<=10**10 and s%35824==0:
                        print(s, s//35824)
#Проверяем последовательность, где *1 - пропуск и *2 - две цифры
for a1 in '123456789':
    for a2 in '0123456789':
        for a3 in '0123456789':
            for a4 in '0123456789':
                for a5 in '0123456789':
                    s=int(a1+'36'+a2+'2'+a3+'48'+a4+a5)
                    if s<=10**10 and s%35824==0:
                        print(s, s//35824)